In [15]:
import pandas as pd
import numpy as np

In [16]:
df = pd.DataFrame()

In [30]:
df["Name"] = ["Gaurav","Akshay","Prajakta","Amol","Mayuri"]
df["Employed"] = ["yes","yes","yes","no","yes"]
df["Gender"] = ["Male","Male","Female","Male","Female"]
df["Age"] = [22,27,None,20,None]

df

       Name Employed  Gender   Age
0    Gaurav      yes    Male  22.0
1    Akshay      yes    Male  27.0
2  Prajakta      yes  Female   NaN
3      Amol       no    Male  20.0
4    Mayuri      yes  Female   NaN

In [41]:
df['Age'].sum()/df["Age"].count()

23.0

In [42]:
def handle_null_values(dataframe,col):
    mean = df[col].mean()
#     print(mean)
    return dataframe.fillna(mean)

In [43]:
def mean_age_by_group(dataframe,col):
    return dataframe.groupby(col).mean()

In [44]:
def uppercase_col(dataframe):
    dataframe.columns = dataframe.columns.str.upper()
    return dataframe

In [45]:
# create a pipeline that applies both the functions
df.pipe(handle_null_values,col = "Age").pipe(mean_age_by_group,col = "Gender").pipe(uppercase_col)

23.0

         AGE
Gender
Female  23.0
Male    23.0

In [46]:
handle_null_values(df,"Age")
df

23.0

       Name Employed  Gender   Age
0    Gaurav      yes    Male  22.0
1    Akshay      yes    Male  27.0
2  Prajakta      yes  Female   NaN
3      Amol       no    Male  20.0
4    Mayuri      yes  Female   NaN

In [58]:
df.empty

False